app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2018-12-18 19:08:42.020972"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    @article.update(params.require(:article).permit(:title, :description))